Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/atdf/PIC32CM5164LS00064.atdf
        <module name="DIB" version="1.0.0">
          <instance name="DIB">
            <register-group name="DIB" name-in-module="DIB" address-space="base" offset="0xE000EFB0"/>
          </instance>
          <instance name="DIB_NS">
            <register-group name="DIB_NS" name-in-module="DIB" address-space="base" offset="0xE002EFB0"/>
          </instance>
        </module>
        <module name="DMAC" id="U2223" version="2f0">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="CH_BITS" value="4" caption="Number of bits to select channel"/>
              <param name="CH_NUM" value="16" caption="Number of channels"/>
              <param name="EVIN_NUM" value="8" caption="Number of input events"/>
              <param name="EVOUT_NUM" value="8" caption="Number of output events"/>
              <param name="LVL_BITS" value="2" caption="Number of bit to select level priority"/>
              <param name="LVL_NUM" value="4" caption="Enable priority level number"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2" caption="QOS dmac ahb interface reset value"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2" caption="QOS dmac fetch interface reset value"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2" caption="QOS dmac write back interface reset value"/>
              <param name="SPLIT_IRQ_NUM" value="4" caption="Number of IRQ split out"/>
              <param name="TRIG_BITS" value="6" caption="Number of bits to select trigger source"/>
              <param name="TRIG_NUM" value="51" caption="Number of peripheral triggers"/>
              <param name="INSTANCE_ID" value="35" caption="Instance index for DMAC"/>
              <param name="CHANNEL0_INT_SRC" value="15" caption="DMA Channel 0 Interrupt"/>
              <param name="CHANNEL1_INT_SRC" value="16" caption="DMA Channel 1 Interrupt"/>
              <param name="CHANNEL2_INT_SRC" value="17" caption="DMA Channel 2 Interrupt"/>
              <param name="CHANNEL3_INT_SRC" value="18" caption="DMA Channel 3 Interrupt"/>
              <param name="CHANNEL4_INT_SRC" value="19" caption="DMA Channel 4 Interrupt"/>
              <param name="CHANNEL5_INT_SRC" value="19" caption="DMA Channel 5 Interrupt"/>
              <param name="CHANNEL6_INT_SRC" value="19" caption="DMA Channel 6 Interrupt"/>
              <param name="CHANNEL7_INT_SRC" value="19" caption="DMA Channel 7 Interrupt"/>
              <param name="CHANNEL8_INT_SRC" value="19" caption="DMA Channel 8 Interrupt"/>
              <param name="CHANNEL9_INT_SRC" value="19" caption="DMA Channel 9 Interrupt"/>
              <param name="CHANNEL10_INT_SRC" value="19" caption="DMA Channel 10 Interrupt"/>
              <param name="CHANNEL11_INT_SRC" value="19" caption="DMA Channel 11 Interrupt"/>
              <param name="CHANNEL12_INT_SRC" value="19" caption="DMA Channel 12 Interrupt"/>
              <param name="CHANNEL13_INT_SRC" value="19" caption="DMA Channel 13 Interrupt"/>
              <param name="CHANNEL14_INT_SRC" value="19" caption="DMA Channel 14 Interrupt"/>
              <param name="CHANNEL15_INT_SRC" value="19" caption="DMA Channel 15 Interrupt"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2810" version="1.1.0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <register-group name="DSU_EXT" name-in-module="DSU" address-space="base" offset="0x41002100" size="0x100"/>
            <parameters>
              <param name="DMAC_ID_DCC0" value="2" caption="DMAC ID for DCC0 register"/>
              <param name="DMAC_ID_DCC1" value="3" caption="DMAC ID for DCC1 register"/>
              <param name="INSTANCE_ID" value="33" caption="Instance index for DSU"/>
            </parameters>
          </instance>
        </module>
        <module name="DWT" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
            <parameters>
              <param name="__WPT_NUM" value="2" caption="Number of DWT watchpoint comparators"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="U2804" version="1.0.0">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002800"/>
            <register-group name="EIC_SEC" name-in-module="EIC" address-space="base" offset="0x40002A00"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA09"/>
              <signal group="EXTINT" index="0" function="A" pad="PA19"/>
              <signal group="EXTINT" index="0" function="A" pad="PB00"/>
              <signal group="EXTINT" index="0" function="A" pad="PB16"/>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA10"/>
              <signal group="EXTINT" index="1" function="A" pad="PA22"/>
              <signal group="EXTINT" index="1" function="A" pad="PB01"/>
              <signal group="EXTINT" index="1" function="A" pad="PB17"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA11"/>
              <signal group="EXTINT" index="2" function="A" pad="PA23"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA14"/>
              <signal group="EXTINT" index="3" function="A" pad="PA24"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA15"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="4" function="A" pad="PA25"/>
              <signal group="EXTINT" index="4" function="A" pad="PB04"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA16"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="5" function="A" pad="PB05"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA17"/>
              <signal group="EXTINT" index="6" function="A" pad="PA30"/>
              <signal group="EXTINT" index="6" function="A" pad="PB06"/>
              <signal group="EXTINT" index="6" function="A" pad="PB22"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA18"/>
              <signal group="EXTINT" index="7" function="A" pad="PA31"/>
              <signal group="EXTINT" index="7" function="A" pad="PB07"/>
              <signal group="EXTINT" index="7" function="A" pad="PB23"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="12" function="A" pad="PB12"/>
              <signal group="EXTINT" index="13" function="A" pad="PA13"/>
              <signal group="EXTINT" index="13" function="A" pad="PB13"/>
              <signal group="EXTINT" index="14" function="A" pad="PB14"/>
              <signal group="EXTINT" index="14" function="A" pad="PB30"/>
              <signal group="EXTINT" index="15" function="A" pad="PB15"/>
              <signal group="EXTINT" index="15" function="A" pad="PB31"/>
              <signal group="NMI" function="A" pad="PA08"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16" caption="Number of external interrupts"/>
              <param name="GCLK_ID" value="4" caption="Generic Clock index"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2" caption="Number of CONFIG registers"/>
              <param name="NUMBER_OF_DPRESCALER_REGS" value="2" caption="Number of DPRESCALER registers"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16" caption="Number of external interrupts (obsolete)"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Security Configuration implemented?"/>
              <param name="INSTANCE_ID" value="10" caption="Instance index for EIC"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="U2504" version="2a1">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x42000000"/>
            <register-group name="EVSYS_SEC" name-in-module="EVSYS" address-space="base" offset="0x42000200"/>
            <parameters>
              <param name="ASYNCHRONOUS_CHANNELS" value="0x00000F00" caption="Mask of Only Asynchronous Channels"/>
              <param name="CHANNELS" value="12" caption="Total Number of Channels"/>
              <param name="CHANNELS_BITS" value="4" caption="Number of bits to select Channel"/>
              <param name="GCLK_ID_0" value="8" caption="Index of Generic Clock 0"/>
              <param name="GCLK_ID_1" value="9" caption="Index of Generic Clock 1"/>
              <param name="GCLK_ID_2" value="10" caption="Index of Generic Clock 2"/>
              <param name="GCLK_ID_3" value="11" caption="Index of Generic Clock 3"/>
              <param name="GCLK_ID_4" value="12" caption="Index of Generic Clock 4"/>
              <param name="GCLK_ID_5" value="13" caption="Index of Generic Clock 5"/>
              <param name="GCLK_ID_6" value="14" caption="Index of Generic Clock 6"/>
              <param name="GCLK_ID_7" value="15" caption="Index of Generic Clock 7"/>
              <param name="GENERATORS" value="91" caption="Total Number of Event Generators"/>
              <param name="GENERATORS_BITS" value="7" caption="Number of bits to select Event Generator"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Security Configuration implemented?"/>
              <param name="SYNCH_NUM" value="8" caption="Number of Synchronous Channels"/>
              <param name="SYNCH_NUM_BITS" value="3" caption="Number of bits to select Synchronous Channels"/>
              <param name="USERS" value="52" caption="Total Number of Event Users"/>
              <param name="USERS_BITS" value="6" caption="Number of bits to select Event User"/>
              <param name="USERS_GROUPS" value="2" caption="Number of 32-user Groups"/>
              <param name="USER_CHN_BITS" value="4" caption="Number of bits to select Channel in USER register"/>
              <param name="INSTANCE_ID" value="64" caption="Instance index for EVSYS"/>
            </parameters>
          </instance>
        </module>
