Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/atdf/PIC32CM5164LS00064.atdf
        <register name="INTENSET" offset="0x10" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="DONE" caption="NVM Done Interrupt Enable" mask="0x1"/>
          <bitfield name="PROGE" caption="Programming Error Status Interrupt Enable" mask="0x2"/>
          <bitfield name="LOCKE" caption="Lock Error Status Interrupt Enable" mask="0x4"/>
          <bitfield name="NVME" caption="NVM Error Interrupt Enable" mask="0x8"/>
          <bitfield name="KEYE" caption="Key Write Error Interrupt Enable" mask="0x10"/>
          <bitfield name="NSCHK" caption="NS configuration change detected Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="DONE" caption="NVM Done" mask="0x1"/>
          <bitfield name="PROGE" caption="Programming Error Status" mask="0x2"/>
          <bitfield name="LOCKE" caption="Lock Error Status" mask="0x4"/>
          <bitfield name="NVME" caption="NVM Error" mask="0x8"/>
          <bitfield name="KEYE" caption="KEY Write Error" mask="0x10"/>
          <bitfield name="NSCHK" caption="NS configuration change detected" mask="0x20"/>
        </register>
        <register name="STATUS" offset="0x18" rw="R" size="2" initval="0x0000" caption="Status">
          <bitfield name="PRM" caption="Power Reduction Mode" mask="0x1"/>
          <bitfield name="LOAD" caption="NVM Page Buffer Active Loading" mask="0x2"/>
          <bitfield name="READY" caption="NVM Ready" mask="0x4"/>
          <bitfield name="DALFUSE" caption="Debug Access Level Fuse" mask="0x18" values="NVMCTRL_STATUS__DALFUSE"/>
        </register>
        <register name="ADDR" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="AOFFSET" caption="NVM Address Offset In The Selected Array" mask="0xFFFF"/>
          <bitfield name="ARRAY" caption="Array Select" mask="0xC00000" values="NVMCTRL_ADDR__ARRAY"/>
        </register>
        <register name="SULCK" offset="0x20" rw="RW" size="2" caption="Secure Unlock Register">
          <bitfield name="BS" caption="Secure Flash (BOOTPROT/BS Region)" mask="0x1"/>
          <bitfield name="AS" caption="Secure Flash (AS Region)" mask="0x2"/>
          <bitfield name="DS" caption="Secure Data Flash (DS Region)" mask="0x4"/>
          <bitfield name="SLKEY" caption="Write Key" mask="0xFF00" values="NVMCTRL_SULCK__SLKEY"/>
        </register>
        <register name="NSULCK" offset="0x22" rw="RW" size="2" caption="Non-Secure Unlock Register">
          <bitfield name="ANS" caption="Non-Secure Flash (ANS Region)" mask="0x2"/>
          <bitfield name="DNS" caption="Non-Secure Data Flash (DNS Region)" mask="0x4"/>
          <bitfield name="NSLKEY" caption="Write Key" mask="0xFF00" values="NVMCTRL_NSULCK__NSLKEY"/>
        </register>
        <register name="PARAM" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="NVM Parameter">
          <bitfield name="FLASHP" caption="FLASH Pages" mask="0xFFFF"/>
          <bitfield name="PSZ" caption="Page Size" mask="0x70000" values="NVMCTRL_PARAM__PSZ"/>
          <bitfield name="DFLASHP" caption="DATAFLASH Pages" mask="0xFFF00000"/>
        </register>
        <register name="DSCC" offset="0x30" rw="W" size="4" initval="0x00000000" caption="Data Scramble Configuration">
          <bitfield name="DSCKEY" caption="Data Scramble Key" mask="0x3FFFFFFF"/>
        </register>
        <register name="SECCTRL" offset="0x34" rw="RW" size="4" initval="0x00000030" caption="Security Control">
          <bitfield name="TAMPEEN" caption="Tamper Erase Enable" mask="0x1"/>
          <bitfield name="SILACC" caption="Silent Access" mask="0x4"/>
          <bitfield name="DSCEN" caption="Data Scramble Enable" mask="0x8"/>
          <bitfield name="SCFGWEN" caption="Security Configuration Write Enable" mask="0x10"/>
          <bitfield name="DALUN" caption="DAL unlock" mask="0x20"/>
          <bitfield name="DXN" caption="Data Flash is eXecute Never" mask="0x40"/>
          <bitfield name="TEROW" caption="Tamper Rease Row" mask="0x700"/>
          <bitfield name="KEY" caption="Write Key" mask="0xFF000000" values="NVMCTRL_SECCTRL__KEY"/>
        </register>
        <register name="SCFGB" offset="0x38" rw="RW" size="4" initval="0x00000003" caption="Secure Boot Configuration">
          <bitfield name="BCREN" caption="Boot Configuration Row Read Enable" mask="0x1"/>
          <bitfield name="BCWEN" caption="Boot Configuration Row Write Enable" mask="0x2"/>
        </register>
        <register name="SCFGAD" offset="0x3C" rw="RW" size="4" initval="0x00000001" caption="Secure Application and Data Configuration">
          <bitfield name="URWEN" caption="User Row Write Enable" mask="0x1"/>
        </register>
        <register name="NONSEC" offset="0x40" rw="RW" size="4" initval="0x00000001" caption="Non-secure Write Enable">
          <bitfield name="WRITE" caption="Non-secure APB alias write enable, non-secure AHB writes to non-secure regions enable" mask="0x1"/>
        </register>
        <register name="NSCHK" offset="0x44" rw="RW" size="4" initval="0x00000001" caption="Non-secure Write Reference Value">
          <bitfield name="WRITE" caption="Reference value to be checked against NONSEC.WRITE" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="NVMCTRL_CTRLA__CMD">
        <value name="ER" caption="Erase Row - Erases the row addressed by the ADDR register." value="0x02"/>
        <value name="WP" caption="Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register." value="0x04"/>
        <value name="SPRM" caption="Sets the power reduction mode." value="0x42"/>
        <value name="CPRM" caption="Clears the power reduction mode." value="0x43"/>
        <value name="PBC" caption="Page Buffer Clear - Clears the page buffer." value="0x44"/>
        <value name="INVALL" caption="Invalidate all cache lines." value="0x46"/>
        <value name="SDAL0" caption="Set DAL=0" value="0x4B"/>
        <value name="SDAL1" caption="Set DAL=1" value="0x4C"/>
        <value name="SDAL2" caption="Set DAL=2" value="0x4D"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLA__CMDEX">
        <value name="KEY" caption="Execution Key" value="0xA5"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__READMODE">
        <value name="NO_MISS_PENALTY" caption="The NVM Controller (cache system) does not insert wait states on a cache miss. Gives the best system performance." value="0x0"/>
        <value name="LOW_POWER" caption="Reduces power consumption of the cache system, but inserts a wait state each time there is a cache miss. This mode may not be relevant if CPU performance is required, as the application will be stalled and may lead to increase run time." value="0x1"/>
        <value name="DETERMINISTIC" caption="The cache system ensures that a cache hit or miss takes the same amount of time, determined by the number of programmed flash wait states. This mode can be used for real-time applications that require deterministic execution timings." value="0x2"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__SLEEPPRM">
        <value name="WAKEONACCESS" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode upon first access." value="0"/>
        <value name="WAKEUPINSTANT" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode when exiting sleep." value="1"/>
        <value name="DISABLED" caption="Auto power reduction disabled." value="3"/>
      </value-group>
      <value-group name="NVMCTRL_STATUS__DALFUSE">
        <value name="DAL0" caption="Access to very limited features" value="0x0"/>
        <value name="DAL1" caption="Access to all non-secure memory. Can debug non-secure CPU code" value="0x1"/>
        <value name="DAL2" caption="Access to all memory. Can debug secure and non-secure CPU code" value="0x2"/>
      </value-group>
      <value-group name="NVMCTRL_ADDR__ARRAY">
        <value name="FLASH" caption="FLASH" value="0x0"/>
        <value name="DATAFLASH" caption="DATA FLASH" value="0x1"/>
        <value name="NVMROWS" caption="NVM Configuration Rows" value="0x2"/>
      </value-group>
      <value-group name="NVMCTRL_SULCK__SLKEY">
        <value name="KEY" caption="Write Key" value="0xA5"/>
      </value-group>
