Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/atdf/PIC32CM5164LS00064.atdf
      <value-group name="TCC_EVCTRL__CNTSEL">
        <value name="START" caption="An interrupt/event is generated when a new counter cycle starts" value="0"/>
        <value name="END" caption="An interrupt/event is generated when a counter cycle ends" value="1"/>
        <value name="BOUNDARY" caption="An interrupt/event is generated when a new counter cycle starts or a counter cycle ends" value="3"/>
      </value-group>
      <value-group name="TCC_EVCTRL__EVACT0">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Start, restart or re-trigger counter on event" value="1"/>
        <value name="COUNTEV" caption="Count on event" value="2"/>
        <value name="START" caption="Start counter on event" value="3"/>
        <value name="INC" caption="Increment counter on event" value="4"/>
        <value name="COUNT" caption="Count on active state of asynchronous event" value="5"/>
        <value name="STAMP" caption="Stamp capture" value="6"/>
        <value name="FAULT" caption="Non-recoverable fault" value="7"/>
      </value-group>
      <value-group name="TCC_EVCTRL__EVACT1">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Re-trigger counter on event" value="1"/>
        <value name="DIR" caption="Direction control" value="2"/>
        <value name="STOP" caption="Stop counter on event" value="3"/>
        <value name="DEC" caption="Decrement counter on event" value="4"/>
        <value name="PWP" caption="Period capture value in CC1 register, pulse width capture value in CC0 register" value="6"/>
        <value name="FAULT" caption="Non-recoverable fault" value="7"/>
      </value-group>
      <value-group name="TCC_WAVE__RAMP">
        <value name="RAMP1" caption="RAMP1 operation" value="0"/>
        <value name="RAMP2A" caption="Alternative RAMP2 operation" value="1"/>
        <value name="RAMP2" caption="RAMP2 operation" value="2"/>
        <value name="RAMP2C" caption="Critical RAMP2 operation" value="3"/>
        <value name="RAMP2CS" caption="Critical Swapped RAMP2 operation" value="4"/>
      </value-group>
      <value-group name="TCC_WAVE__WAVEGEN">
        <value name="NFRQ" caption="Normal frequency" value="0"/>
        <value name="MFRQ" caption="Match frequency" value="1"/>
        <value name="NPWM" caption="Normal PWM" value="2"/>
        <value name="DPWM" caption="Dual compare PWM" value="3"/>
        <value name="DSCRITICAL" caption="Dual-slope critical" value="4"/>
        <value name="DSBOTTOM" caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO" value="5"/>
        <value name="DSBOTH" caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP" value="6"/>
        <value name="DSTOP" caption="Dual-slope with interrupt/event condition when COUNT reaches TOP" value="7"/>
      </value-group>
      <value-group name="TCC_WAVE__POL">
        <value name="SINGLESLOPEPOL0" caption="Single-slope PWM waveform generation Channel Polarity 0" value="0"/>
        <value name="SINGLESLOPEPOL1" caption="Single-slope PWM waveform generation Channel Polarity 1" value="1"/>
        <value name="DUALSLOPEPOL0" caption="Dual-slope PWM waveform generation Channel Polarity 0" value="0"/>
        <value name="DUALSLOPEPOL1" caption="Dual-slope PWM waveform generation Channel Polarity 1" value="1"/>
        <value name="DUALCOMPAREPOL0" caption="Dual Compare PWM waveform generation Channel Polarity 0" value="0"/>
        <value name="DUALCOMPAREPOL1" caption="Dual Compare PWM waveform generation Channel Polarity 1" value="1"/>
      </value-group>
    </module>
    <module name="TRAM" id="U2801" version="2.0.0" caption="TrustRAM">
      <register-group name="TRAM" caption="TrustRAM">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="TAMPERS" caption="Tamper Erase" mask="0x10"/>
          <bitfield name="DRP" caption="Data Remanence Prevention" mask="0x40"/>
          <bitfield name="SILACC" caption="Silent Access" mask="0x80"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="ERR" caption="TrustRAM Readout Error Interrupt Enable" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="ERR" caption="TrustRAM Readout Error Interrupt Enable" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="ERR" caption="TrustRAM Readout Error" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x7" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="RAMINV" caption="RAM Inversion Bit" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ongoing" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Status">
          <bitfield name="SWRST" caption="Software Reset Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Busy" mask="0x2"/>
        </register>
        <register name="DSCC" offset="0xC" rw="W" size="4" initval="0x00000000" caption="Data Scramble Control">
          <bitfield name="DSCKEY" caption="Data Scramble Key" mask="0x3FFFFFFF"/>
          <bitfield name="DSCEN" caption="Data Scramble Enable" mask="0x80000000"/>
        </register>
        <register name="RAM" offset="0x200" rw="RW" size="4" count="128" initval="0x00000000" caption="TrustRAM">
          <mode name="DEFAULT"/>
          <mode name="BYTE"/>
          <mode name="HALFWORD"/>
          <bitfield modes="BYTE" name="BYTE0" caption="Trust RAM Data" mask="0xFF"/>
          <bitfield modes="BYTE" name="BYTE1" caption="Trust RAM Data" mask="0xFF00"/>
          <bitfield modes="HALFWORD" name="HWORD0" caption="Trust RAM Halfword Data" mask="0xFFFF"/>
          <bitfield modes="BYTE" name="BYTE2" caption="Trust RAM Data" mask="0xFF0000"/>
          <bitfield modes="BYTE" name="BYTE3" caption="Trust RAM Data" mask="0xFF000000"/>
          <bitfield modes="HALFWORD" name="HWORD1" caption="Trust RAM Halfword Data" mask="0xFFFF0000"/>
          <bitfield modes="DEFAULT" name="DATA" caption="Trust RAM Data" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="TRNG" id="03597" version="1d0" caption="True Random Generator">
      <register-group name="TRNG" caption="True Random Generator">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
